#01 Menyertakan Prefix dan suffix di kolom data frame

Import Modules (ini bisa membawa perbedaan jika versi yang kita pake berbeda dgn yang lain/code yang di buat)

In [2]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

Preparement Data Frame

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('abcde')

df=pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)),columns=cols)
df

   a  b  c  d  e
0  1  3  8  9  5
1  5  5  4  5  6
2  9  9  7  7  4
3  5  9  2  8  4
4  9  6  4  9  2

In [5]:
tuple('abcde')

('a', 'b', 'c', 'd', 'e')

Menyertakan prefix Kolom dalam kata lain ada memberi sebuah nama pada tuple di data frame kita

In [7]:
df.add_prefix('Column_')

   Column_a  Column_b  Column_c  Column_d  Column_e
0         1         3         8         9         5
1         5         5         4         5         6
2         9         9         7         7         4
3         5         9         2         8         4
4         9         6         4         9         2

 Meryertakan Suffix kollom hampir mipir dengan prefix namun nama yang kita kasih akan muncul di belakang tuple kita

In [9]:
df.add_suffix('_field')

   a_field  b_field  c_field  d_field  e_field
0        1        3        8        9        5
1        5        5        4        5        6
2        9        9        7        7        4
3        5        9        2        8        4
4        9        6        4        9        2

#02 Pemiliahan baris (rows selection) pada data frame kita

Import Modules (ini bisa membawa perbedaan jika versi yang kita pake berbeda dgn yang lain/code yang di buat)

In [10]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

Preparement Data Frame

In [13]:
n_rows = 10
n_cols = 5
cols = tuple('abcde')

df=pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)),columns=cols)
df

   a  b  c  d  e
0  1  2  4  2  3
1  1  2  3  2  4
2  1  1  4  2  1
3  1  1  1  3  4
4  2  4  1  3  2
5  4  4  1  1  1
6  3  1  1  3  2
7  4  1  2  4  3
8  3  2  1  3  4
9  2  4  3  2  3

selection dengan operator logika |

In [16]:
df[(df ['a'] == 1)| (df ['a'] ==3)]

   a  b  c  d  e
0  1  2  4  2  3
1  1  2  3  2  4
2  1  1  4  2  1
3  1  1  1  3  4
6  3  1  1  3  2
8  3  2  1  3  4

selection dengan fungsi isin() sama dengan cara operator logika

In [18]:
df[df['a'].isin([1,3])]

   a  b  c  d  e
0  1  2  4  2  3
1  1  2  3  2  4
2  1  1  4  2  1
3  1  1  1  3  4
6  3  1  1  3  2
8  3  2  1  3  4

operator negasi yaitu  mengecualikan data yang kita input ~

In [19]:
df[~df['a'].isin([1,3])]

   a  b  c  d  e
4  2  4  1  3  2
5  4  4  1  1  1
7  4  1  2  4  3
9  2  4  3  2  3

#03 Mengekonversikan tipe data String ke numerik pada kolom data frame

Import Modules

In [20]:
import pandas as pd
print(pd.__version__)

1.3.4

persiapan data frame

In [22]:
data ={'col1':['1','2','3','teks'],'col2':['1','2','3','4']}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [23]:
df.dtypes

col1    object
col2    object
dtype: object

konversi tipe data dengan fungsi ASTYPE() sama seperti yang di atas namun melalui sebuah conversion

In [27]:
df_x = df.astype({'col2':'float'})
df_x

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [26]:
df_x.dtypes

col1    object
col2     int32
dtype: object

konversi tipe data numerik dengan fungsi to_numeric()

In [29]:
df.apply(pd.to_numeric,errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

#04 pemilihan kolom(colums selection)pada Data Frame berdasarkan tipe data

Import Modules (ini bisa membawa perbedaan jika versi yang kita pake berbeda dgn yang lain/code yang di buat)

In [30]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [43]:
n_rows = 5
n_cols = 2
cols= ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20, size =(n_rows,n_cols)),
                 columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index =pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()
        
df['teks'] = list('abcde')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          5.0         14    a
1 2000-01-01 01:00:00         11.0         17    b
2 2000-01-01 02:00:00         11.0         15    c
3 2000-01-01 03:00:00          5.0          2    d
4 2000-01-01 04:00:00          7.0         10    e

In [44]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

memilih kolom bertipe data numerik

In [45]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          5.0         14
1         11.0         17
2         11.0         15
3          5.0          2
4          7.0         10

In [46]:
df.select_dtypes(include='float')

   bil_pecahan
0          5.0
1         11.0
2         11.0
3          5.0
4          7.0

In [48]:
df.select_dtypes(include='int')

   bil_bulat
0         14
1         17
2         15
3          2
4         10

memilih kolom tipe data string atau object

In [49]:
df.select_dtypes(include='object')

  teks
0    a
1    b
2    c
3    d
4    e

memilih kolom tipe data datetime

In [50]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

menampilkan kolom dengan kombinasi data

In [51]:
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          5.0         14    a
1         11.0         17    b
2         11.0         15    c
3          5.0          2    d
4          7.0         10    e